{
  "name": "Luiz Messias",
  "photo": "https://avatars.githubusercontent.com/u/200773624?s=400&u=84dae14d67a9124c0c0bdb4b0e3c0dd60e862f4c&v=4",
  "job": "Software Developer",
  "location": "Minas Gerais, Brazil",
  "phone": "(35) 99111-6124",
  "email": "luizgdsmdev@gmail.com",
  "skills": {
    "hardSkills": [
      {
        "name": "Javascript",
        "logo": "./data/imgs/javascript.png"
      },
      {
        "name": "Nodejs",
        "logo": "./data/imgs/nodejs.png"
      },
      {
        "name": "Python",
        "logo": "./data/imgs/python.png"
      },
      {
        "name": "Php",
        "logo": "./data/imgs/php.png"
      },
      {
        "name": "React",
        "logo": "./data/imgs/react.png"
      },
      {
        "name": "Git",
        "logo": "./data/imgs/git.png"
      },
      {
        "name": "Docker",
        "logo": "./data/imgs/docker.png"
      },
      {
        "name": "Mongodb",
        "logo": "./data/imgs/mongodb.png"
      },
      {
        "name": "Postgresql",
        "logo": "./data/imgs/postgresql.png"
      },
            {
        "name": "Java",
        "logo": "./data/imgs/java.png"
      }
    ],
    "softSkills": [
      "Effective Communication",
      "Problem Solving",
      "Project Coordination",
      "Training New Staff",
      "Process Optimization",
      "Customer Service"
    ]
  },
  "languages": [
    "Português-BR (Fluent)",
    "Inglês (Advanced - C2)"
  ],
  "portfolio": [
    {
      "name": "Challenge 5: HBO Website",
      "url": "https://github.com/luizgdsmdev/challenge-5-HBO-css-javascript",
      "github": true,
      "liveUrl": "https://luizgdsmdev.github.io/challenge-5-HBO-css-javascript/",
      "description": "A web-based project replicating a component of the HBO website, built with JavaScript, HTML, and CSS. This challenge focuses on creating a responsive and interactive webpage that mirrors the design and functionality of the HBO platform. live link: https://luizgdsmdev.github.io/challenge-5-HBO-css-javascript/"
    },
    {
      "name": "Challenge 2: Youtube clone",
      "url": "https://github.com/luizgdsmdev/challenge-2-Youtube-css-javascript",
      "github": true,
      "liveUrl": "https://luizgdsmdev.github.io/challenge-2-Youtube-css-javascript/",
      "description": "This repository contains the solution for a coding challenge (Challenge #2) aimed at building a YouTube-like interface. The project demonstrates front-end development skills by using HTML for structure, CSS for modern styling, and JavaScript for dynamic interactivity. The codebase is lightweight, designed to run directly in the browser, and emphasizes a clean, user-friendly design inspired by YouTube's aesthetic. live link: https://luizgdsmdev.github.io/challenge-2-Youtube-css-javascript/"
    },
    {
      "name": "Wreck-It-Ralph Game",
      "url": "https://github.com/luizgdsmdev/Wreck-It-Ralph-game-javascript-css-html",
      "github": true,
      "liveUrl": "https://luizgdsmdev.github.io/Wreck-It-Ralph-game-javascript-css-html/",
      "description": "This project is a simple yet engaging web game that recreates the arcade spirit of Wreck-It Ralph. The codebase is structured to be lightweight and accessible, leveraging core web technologies to deliver a smooth gaming experience directly in the browser. The game features a single HTML file for structure, CSS for styling and animations, and JavaScript for game logic, including player movement, collision detection, and score tracking. live link: https://luizgdsmdev.github.io/Wreck-It-Ralph-game-javascript-css-html/"
    },
    {
      "name": "Finans Website",
      "url": "https://github.com/luizgdsmdev/project-finans",
      "github": true,
      "liveUrl": "https://luizgdsmdev.github.io/project-finans/",
      "description": "A web-based project replicating a fictional financial management website, built with HTML, CSS, and JavaScript. This project focuses on creating a professional and responsive interface for managing personal finances, featuring interactive elements and a clean design inspired by modern financial platforms. Live link: https://luizgdsmdev.github.io/project-finans/"
    },
    {
      "name": "Challenge 4: Responsive Layout Challenge with Bootstrap",
      "url": "https://github.com/luizgdsmdev/challenge-4-responsive-layout-bootstrap-javascript",
      "github": true,
      "liveUrl": "https://luizgdsmdev.github.io/challenge-4-responsive-layout-bootstrap-javascript/",
      "description": "This repository contains the solution for the fourth challenge of the CSS Developer course offered by DIO. The project aims to recreate a cofee shop-inspired webpage layout, emphasizing responsive design using Bootstrap's grid system and components, enhanced with custom CSS and JavaScript for interactivity. The codebase is lightweight, runs directly in the browser, and showcases advanced front-end techniques for building a professional streaming platform interface. The project remains under constant development. Last updated: July 30, 2025. Live link: https://luizgdsmdev.github.io/challenge-4-responsive-layout-bootstrap-javascript/"
    },
    {
      "name": "Challenge 3: responsive layout for Discord",
      "url": "https://github.com/luizgdsmdev/challenge-3-responsive-layout-for-Discord-CSS-javascript",
      "github": true,
      "liveUrl": "https://luizgdsmdev.github.io/challenge-3-responsive-layout-for-Discord-CSS-javascript/",
      "description": "This project contains the solution for the third challenge of the CSS Developer course offered by DIO. The project aims to recreate a Discord-inspired webpage layout, emphasizing responsive design and interactivity. It uses HTML for structure, CSS for styling with Flexbox or Grid, and JavaScript for dynamic features like toggling menus or modals. The codebase is lightweight, runs directly in the browser, and showcases advanced CSS techniques alongside basic JavaScript interactivity."
    },
    {
      "name": "Challenge 1: Web page Dio",
      "url": "https://github.com/luizgdsmdev/challenge-1-css-developer",
      "github": true,
      "liveUrl": "https://luizgdsmdev.github.io/challenge-1-css-developer/",
      "description": "A web-based project designed to replicate a modern webpage layout, built with HTML and CSS. This challenge, part of a CSS Developer course from DIO, focuses on creating a visually appealing and responsive interface from scratch, based on a provided YouTube layout, emphasizing CSS styling techniques. live link: https://luizgdsmdev.github.io/challenge-1-css-developer/"
    },
    {
      "name": "More than just a Pokedex (Partial development)",
      "url": "https://raw.githubusercontent.com/luizgdsmdev/more-than-just-a-pokedex",
      "github": true,
      "liveUrl": "https://luizgdsmdev.github.io/more-than-just-a-pokedex/",
      "description": "A dynamic web-based Pokédex application built with HTML, CSS, and JavaScript, designed to provide an interactive Pokémon experience. This project, created for practice, focuses on advanced front-end techniques, including API consumption, DOM manipulation, and data processing, while offering features like Pokémon listings, battles, and evolution tracking. The project will be updated in phases, with each phase implementing one or more features, as well as revisions/corrections if necessary."
    }
  ],
  "professionalExperience": [
    {
      "name": "PROD DIGITAL AGENCY LTDA - Software Developer",
      "period": "10/2021 - 01/2025",
      "description": "As a Software Developer and Email Marketing Analyst, I helped to develop, manage, and execute marketing strategies for clients, earning two promotions and actively participating in meetings to present results and align strategies with stakeholders. In software development, I collaborated closely with systems analysts and programmers to resolve issues, enhance capabilities, and apply security measures, ensuring robust, high-performing systems using established design patterns. I analyzed user needs, reviewed project requirements, and coordinated testing throughout the development lifecycle while modifying software to fix errors and improve interfaces. I recommended strategies to optimize equipment performance and team workflow, provided technical support, and contributed to successful project completion."
    },
    {
      "name": "NATANAEL ANALIO CIA LTDA (knn English school) - English Teacher",
      "period": "07/2022 - 10/2022",
      "description": "As an English teacher, I delivered lessons to students aged 8 to 45 over a period of more than four months. I designed tailored lesson plans for individual students, provided content correction and educational guidance, and developed supplementary materials to reinforce language skills. I offered personalized coaching to improve writing, pronunciation, listening, and speaking in English. Additionally, I contributed to creating engaging content and extracurricular activities to enhance student interaction and learning."
    },
    {
      "name": "Napoleão Brewery and Restaurant - Restaurant Service Manager",
      "period": "07/2018 - 01/2021",
      "description": "As Restaurant Service Manager at Napoleão Brewery and Restaurant, I was promoted from waiter and kitchen assistant due to my strong performance. I managed customer service, dining area cleaning and organization, and improved processes for food preparation, service, and bar cash handling. Additionally, I oversaw cash management, including receiving and paying for goods, organized inventory, and trained new team members."
    },
    {
      "name": "Seis e Meia restaurant - Restaurant Staff Member",
      "period": "05/2016 - 06/2018",
      "description": "As a Multi-Role Restaurant Staff member, I excelled as a waiter and kitchen assistant, earning a promotion to pizza maker due to strong performance. In this role, I managed pizza and condiment production and trained new employees. As a waiter, I handled dining area organization, customer service, order and payment processing, and inventory maintenance. As a kitchen assistant, I ensured kitchen cleanliness, organized and stored condiments, and assisted with partial or full dish preparation"
    },
    {
      "name": "PKC Group - Administrative Assistant",
      "period": "03/2014 - 04/2015",
      "description": "As an Administrative Assistant apprentice at PKC Group, I worked in Customer Service, issuing invoices using MICROSIGA TOTVS, assisting with inventory control, preparing documents for goods dispatch with the WISE program, entering internal notes, verifying data, and managing spreadsheet data and physical parts inventory. Due to strong performance, I was hired full-time after 11 months, with the role concluding when the company ceased operations in the state."
    },
    {
      "name": "MAHLE Group - Administrative Assistant (Formare Internship)",
      "period": "03/2013 - 12/2013",
      "description": "As an apprentice at MAHLE in Itajubá, Brazil, from March to December 2013, I worked as an administrative assistant in the Formare internship program. In the Bushings and Washers Administrative Sector, I handled internal note entries, data verification, and spreadsheet data entry using SAP, while assisting with inventory control and physical parts management. In the Medical Clinic Reception, I managed employee reception, provided customer service, performed data entry and verification using SAP, and organized file management."
    }
  ],
  "personalSummary": [
    {
      "description": "As a versatile professional with advanced English proficiency, I bring problem-solving and adaptability from diverse roles in software development, marketing, and fieldwork. As a Software Developer and Email Marketing Analyst, I earned two promotions by enhancing systems, coordinating testing, and executing marketing strategies. As an English teacher, I created tailored lesson plans to boost student engagement. My skills and quick learning ensure high-quality contributions."
    }
  ]
}